app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])

    @comment = @post.comments.build(comment_params)
    @comment.post = @post
    @comment.user = @current_user

    if @comment.save
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1
INSERT INTO `comments` (`post_id`, `user_id`, `body`, `created_at`, `updated_at`) VALUES (5, 12, 'this is first comment', '2024-12-25 16:25:44.148926', '2024-12-25 16:25:44.148926')

  def destroy

    @comment = Comment.find(params[:comment_id])

    if @comment[:user_id]!= @current_user[:id]
               render json: { error: 'Unauthorized' }, status: :unauthorized
      return
    end

    if @comment.destroy
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 5 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1

  def update

    @comment = Comment.find(params[:comment_id])

    if @comment[:user_id]!= @current_user[:id]
      render json: { error: 'Unauthorized' }, status: :unauthorized
      return
    end

    if @comment.update(comment_params)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
UPDATE `comments` SET `comments`.`body` = 'this is updated comment..', `comments`.`updated_at` = '2024-12-25 16:48:51.154134' WHERE `comments`.`id` = 3

  def authenticate_user
    token = request.headers['Authorization']&.split(' ')&.last
    puts "Token received: #{token.inspect}"

    if token.present?
      decoded_token = decode_jwt(token)
      puts "Decoded Token: #{decoded_token.inspect}"
      @current_user = User.find_by(id: decoded_token["user_id"])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1

  def set_post
    @post = Post.find(params[:post_id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1