app/controllers/user_controller.rb

  def register
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `image`, `created_at`, `updated_at`, `password_digest`) VALUES ('ahmed nasser', 'ahmed555@gmail.com', NULL, NULL, '2024-12-24 13:07:21.307488', '2024-12-24 13:07:21.307488', '$2a$12$R/poHtma.FRutDTo2Y6JX.d2HYEQ3bksb9T/xyMdDU.MaKBdyaEo6')

  def login
    # Check for missing email or password
    if params[:email].blank? || params[:password].blank?
      return render json: { error: 'Please provide email and password' }, status: :bad_request
    end

    user = User.find_by(email: params[:email].downcase)  # Case-insensitive search
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'ahmed6@example.com' LIMIT 1